Revit 2027 API
Frame.IsOrthonormal Method
 Determines if this frame's basis vectors are orthonormal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrthonormal()
Public Function IsOrthonormal As Boolean
public:
bool IsOrthonormal()
member IsOrthonormal : unit -> bool
Return Value
Boolean
 True if this frame's basis vectors are orthonormal, false if not.
Remarks
 "Orthonormal" means that the three vectors are orthogonal and each of them has unit length.
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace